{
  "name": "Templar",
  "description": "The Knights Templar were the elite fighting force of their day, highly trained, well-equipped and highly motivated; one of the tenets of their religious order was that they were forbidden from retreating in battle, unless outnumbered three to one, and even then only by order of their commander, or if the Templar flag went down. Not all Knights Templar were warriors. The mission of most of the members was one of support – to acquire resources which could be used to fund and equip the small percentage of members who were fighting on the front lines. There were actually three classes within the orders. The highest class was the knight. When a candidate was sworn into the order, they made the knight a monk. They wore white robes. The knights could hold no property and receive no private letters. He could not be married or betrothed and cannot have any vow in any other Order. He could not have debt more than he could pay, and no infirmities. The Templar priest class was similar to the modern day military chaplain. Wearing green robes, they conducted religious services, led prayers, and were assigned record keeping and letter writing. They always wore gloves, unless they were giving Holy Communion. The mounted men-at-arms represented the most common class, and they were called \"brothers\". They were usually assigned two horses each and held many positions, including guard, steward, squire or other support vocations. As the main support staff, they wore black or brown robes and were partially garbed in chain mail or plate mail. The armor was not as complete as the knights. Because of this infrastructure, the warriors were well-trained and very well armed. Even their horses were trained to fight in combat, fully armored.[1] The combination of soldier and monk was also a powerful one, as to the Templar knights, martyrdom in battle was one of the most glorious ways to die.",
  "image": "https://lh3.googleusercontent.com/TOfMFM8wSSOJhJkROF6GqxBm7CAVmH3YkxE6q-9lZC8Ft51flk2AX-rKQg47N85QXqLv-WQ-upgxRjh0_xrV_j9JDIW_6KnRKcys=w600"
}